cases/Biofilm_growth/multi_pores/yxs/cyclic-yxs-8/0/CbyC0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField    nonuniform List<scalar> 
31250
(
0.6
0.6
0.6
0.6
0.6
0.6
0.6
0
...
0.6

);


boundaryField
{

    left
    {
         type            fixedValue;
       value	       uniform 0.6;
    }

    right
    {
// type            fixedValue;
 //      value	       uniform 0;        
type           zeroGradient;
 // value	       uniform 0;
    }

    bottom
    {
       type            cyclic;
    }
    top
    {
        type            cyclic;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
